[
    {
        "uid": "714d399a-51ac-400f-9136-5c20fbedf9b2",
        "updateDate": "2017-12-07T03:59:50.0Z",
        "titleText": "Satya Nadella is giving Microsoft a much needed reboot",
        "mainText": "Nadella is No. 11 on the Recode 100. Satya Nadella is doing the improbable: Turning Microsoft around by changing both its business and culture. The company dominated the desktop PC era by selling Windows and Office.",
        "redirectionUrl": "https://www.recode.net/2017/12/6/16680840/satya-nadella-microsoft-ceo-recode-100"
    },
    {
        "uid": "51961480-6752-401b-9f93-46c607946810",
        "updateDate": "2017-12-07T03:59:50.0Z",
        "titleText": "Google Chrome OS maintains dominance in US schools, but Microsoft Windows gains ground globally",
        "mainText": "New market research finds that while Google Chromebooks continue to be the mobile computing device of choice in U.S. schools, the competitive situation is reversed in the rest of the world, where Windows dominates. U.K.-based Futuresource.",
        "redirectionUrl": "https://www.geekwire.com/2017/google-chrome-os-maintains-dominance-us-schools-microsoft-windows-gains-ground-globally/"
    },
    {
        "uid": "fa1936b7-61be-4979-9574-351e19b4fef2",
        "updateDate": "2017-12-07T03:59:50.0Z",
        "titleText": "Microsoft Explains How Windows on Snapdragon Works",
        "mainText": "Could Windows Phone return? Maybe. At a Q&A with Microsoft and Qualcomm execs at Qualcomm's Snapdragon Summit, Qualcomm's Miguel Nunes said 'different form factors' are coming for Windows 10 on Snapdragon, and Microsoft's Erin Chapple.",
        "redirectionUrl": "https://www.pcmag.com/news/357779/microsoft-explains-how-windows-on-snapdragon-works"
    },
    {
        "uid": "a368e14d-41fb-47c1-8797-afa398be79a8",
        "updateDate": "2017-12-07T03:59:50.0Z",
        "titleText": "Microsoft unveils open source tools connecting Kubernetes to Azure",
        "mainText": "Microsoft continued its support for the Kubernetes open source project today, with the unveiling of several enhancements to systems that are designed to make it easier for developers to connect that system with the tech.",
        "redirectionUrl": "https://venturebeat.com/2017/12/06/microsoft-unveils-open-source-tools-connecting-kubernetes-to-azure/"
    }
]
