[
    {
        "uid": "6c65ba3f-4f78-40b3-a9d9-7862f8588e63",
        "updateDate": "2017-10-31T02:58:58.0Z",
        "titleText": "Microsoft to release Surface Pro with LTE Advanced in December, looking to continue recent growth",
        "mainText": "Microsoft will begin shipping a new version of its Surface Pro tablet with LTE Advanced mobile connectivity for businesses in early December, the company’s devices chief Panos Panay announced this morning at its Future Decoded.",
        "redirectionUrl": "https://www.geekwire.com/2017/microsoft-release-surface-pro-lte-advanced-december-looking-continue-recent-growth/"
    },
    {
        "uid": "c32e8a32-83aa-43df-8f4c-6fceeadd21e0",
        "updateDate": "2017-10-31T02:58:58.0Z",
        "titleText": "Microsoft Surface Pro with LTE coming December",
        "mainText": "Microsoft is going all in on helping people work from pretty much anywhere in the world. The company's most advacned, most connected tablet yet, the Surface Pro with LTE Advanced, will be shipping to business customers.",
        "redirectionUrl": "https://www.cnet.com/news/microsoft-surface-pro-with-lte-coming-december/#ftag=CAD590a51e"
    },
    {
        "uid": "c408b716-cec1-48b7-98b1-92621b7054ee",
        "updateDate": "2017-10-31T02:58:58.0Z",
        "titleText": "Microsoft to add free premium features to Outlook.com for Office 365 consumer subscribers",
        "mainText": "Microsoft is starting to roll out to Office 365 Home and Office 365 Personal subscribers some premium capabilities for their Outlook.com accounts for free. Among the features that these users of Microsoft's consumer-focused Office 365 users.",
        "redirectionUrl": "http://www.zdnet.com/article/microsoft-to-add-free-premium-features-to-outlook-com-for-office-365-consumer-subscribers/"
    },
    {
        "uid": "5e9214ce-6365-4a69-93f8-8c42ac96b2b1",
        "updateDate": "2017-10-31T02:58:58.0Z",
        "titleText": "Microsoft Is Getting Hungry for Fuel Cells",
        "mainText": "Microsoft Corp. is moving to use fuel cells at its power-hungry server farms, saying the technology may double the efficiency of energy used. The software company is testing how it can use the devices to generate.",
        "redirectionUrl": "https://www.bloomberg.com/news/articles/2017-10-31/fuel-cells-backed-by-microsoft-for-power-hungry-data-centers"
    },
    {
        "uid": "d31601c2-39fb-4a77-93be-6db9dc8ec193",
        "updateDate": "2017-10-31T02:58:58.0Z",
        "titleText": "Microsoft And Eastern Washington University Collaborate on Bachelor of Science in Data Analytics",
        "mainText": "A constant refrain in business is that too many university graduates have a foundation in theory but not in practice. Within the BI community there’s also a regular expression of the need for far more.",
        "redirectionUrl": "https://www.forbes.com/sites/tiriasresearch/2017/10/30/microsoft-and-eastern-washington-university-collaborate-on-bachelor-of-science-in-data-analytics/"
    }
]
