[
    {
        "uid": "5ee3fd25-8fe9-4139-b8b0-4d656a6d67be",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Microsoft Xbox One X Review: Prep Yourself for the 4K, High-Performance Future",
        "mainText": "SINCE THE DAYS of the NES, most every successful gaming console has basically been released twice. You’d get a big, loud, and expensive box at launch, then a few years later, a smaller, quieter, lower- cost.",
        "redirectionUrl": "https://www.wired.com/2017/11/review-microsoft-xbox-one-x/?utm_medium=twitter&utm_source=dlvr.it"
    },
    {
        "uid": "7bd76134-8448-4edf-951f-b4bc5d02f218",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Xbox One X review: This is the ultimate Xbox",
        "mainText": "This is the Xbox One X. It’s the fastest and smallest Xbox and the first to offer games in 4K. At $499 the higher resolution comes at a steep price. After a week with the.",
        "redirectionUrl": "https://techcrunch.com/2017/11/03/xbox-one-x-review-this-is-the-ultimate-xbox/"
    },
    {
        "uid": "69d01c64-9ff0-4134-8f08-8fbd15bab880",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Apple CEO Cook breathes new life into old iPhones",
        "mainText": "(Reuters) - By delivering solid financial results that beat Wall Street’s expectations for both revenues and profits on Thursday, Apple Inc’s CEO Tim Cook put to rest concerns that the company’s flagship device, the iPhone.",
        "redirectionUrl": "http://www.reuters.com/article/us-apple-results-strategy/apple-ceo-cook-breathes-new-life-into-old-iphones-idUSKBN1D306R?feedType=RSS&feedName=technologyNews&utm_source=Twitter&utm_medium=Social&utm_campaign=Feed%3A+reuters%2FtechnologyNews+%28Reuters+Technology+News%29"
    },
    {
        "uid": "238bf00d-1794-4630-a7d1-ace45ab7c936",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Skype Interviews adds code snapshots and group video calling",
        "mainText": "Conducting an interview with a coding candidate can be tough, especially when the applicant can't easily make it to the office to tackle a project. Skype Interviews was created to aid the process, and new.",
        "redirectionUrl": "https://www.neowin.net/news/skype-interviews-adds-code-snapshots-and-group-video-calling"
    },
    {
        "uid": "14e1b2e0-a2b4-434e-b949-4b99d6bd7699",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Microsoft's Bulks Up Azure SQL for Big Data and AI Era",
        "mainText": "The company offers more cloud-based database options to enterprises beset by big data and AI challenges. Microsoft is making it easier for enterprises and database administrators (DBAs) to harness the cloud to power their cutting-edge, data-intensive.",
        "redirectionUrl": "http://www.eweek.com/cloud/microsoft-s-bulks-up-azure-sql-for-big-data-and-ai-era"
    },
    {
        "uid": "d92d79b5-cafa-413a-b72b-44071cff7fbe",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "What's new in Microsoft's Windows 10 IoT Fall Creators Update release",
        "mainText": "Windows 10 isn't just for PCs. It's also available on other Microsoft device types, including Internet of Things (IoT) devices. On November 2, Microsoft officials detailed some of the features that are part of the latest.",
        "redirectionUrl": "http://www.zdnet.com/article/whats-new-in-microsofts-windows-10-iot-fall-creators-update-release/"
    },
    {
        "uid": "d0e9275d-a47f-4f56-8088-84f620b34d88",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Windows 10 Fluent Design: Microsoft's new-look Mail, Calendar now open to all",
        "mainText": "Microsoft is rolling out a new version of the Mail and Calendar apps for Windows 10 with a design refresh shaped by Fluent Design. Microsoft has been testing the new-look apps with Windows Insiders for the.",
        "redirectionUrl": "http://www.zdnet.com/article/windows-10-fluent-design-microsofts-new-look-mail-calendar-now-open-to-all/"
    },
    {
        "uid": "7b9c4e1d-2013-4fcf-b971-b2ce5c34e94a",
        "updateDate": "2017-11-03T06:22:50.0Z",
        "titleText": "Traditional Tech Said to Push New Sales Incentives to Drive Cloud Use",
        "mainText": "Microsoft Corp., Oracle Corp. and IBM — looking to stoke demand for cloud computing services — are said to be shifting incentives for their sales representatives, pushing them to ensure customers become active users over.",
        "redirectionUrl": "https://www.bloomberg.com/news/articles/2017-11-02/traditional-tech-said-to-push-new-sales-incentives-to-drive-cloud-use"
    }
]
