[
    {
        "uid": "bde60569-8c80-43b8-8aad-1ca7812d31be",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Microsoft to renovate Silicon Valley campus",
        "mainText": "Microsoft is planning to rebuild much of its Silicon Valley office, the company said Tuesday, just days after announcing a major redevelopment of its Redmond headquarters. The software company will tear down three of its five.",
        "redirectionUrl": "https://www.seattletimes.com/business/microsoft/microsoft-to-renovate-silicon-valley-campus/"
    },
    {
        "uid": "4fcef0e4-4bfd-47f8-91ee-cd6edc0d0730",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Microsoft delivers public preview of its new Azure IoT software as a service",
        "mainText": "Microsoft is making available as of today, December 5, a public preview of its IoT software-as-a-service offering called Microsoft IoT Central. Microsoft IoT Central is a software-as-a-service (SaaS) offering for connecting physical devices to back- end services,.",
        "redirectionUrl": "http://www.zdnet.com/article/microsoft-delivers-public-preview-of-its-new-azure-iot-software-as-a-service/"
    },
    {
        "uid": "2d50afb4-8cc0-442c-8bfe-8064dbf76408",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Azure Container Instances vs. AWS Fargate",
        "mainText": "Last week, during their re:Invent 2017 extravaganza, AWS announced their new container service Fargate. Fargate is AWS’s clusterless/serverless way of running containers. Fargate’s announcement was joined by the announcement for AWS managed Kubernetes clusters, dubbed.",
        "redirectionUrl": "https://medium.com/vamp-io/azure-container-instances-vs-aws-fargate-3216607f63f4"
    },
    {
        "uid": "f3023bdc-cf55-432a-b90c-b515d6779e32",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Windows Update is broken for some Windows 7 users",
        "mainText": "Windows 7 users are reporting problems accessing updates through Windows Update and Microsoft Update. The root of the problem may be an expiration date that Microsoft needs to fix on its side, noted Computerworld earlier today. A.",
        "redirectionUrl": "http://www.zdnet.com/article/windows-update-is-broken-for-some-windows-7-users/"
    },
    {
        "uid": "00aa6180-a9c3-4c9f-9971-60563a79f8cb",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Windows 10 picked as 'initial' OS for Germany's new government client",
        "mainText": "The German government has begun work on a Windows 10-based workstation for federal employees. As reported by Heise Online, the German government decided in May 2015 to develop the Bundesclient, or federal client. The development began.",
        "redirectionUrl": "http://www.zdnet.com/article/windows-10-picked-as-initial-os-for-germanys-new-government-client/"
    },
    {
        "uid": "ed8e8434-edff-421d-a334-b5300e9ac273",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Microsoft extends NFL deal for Surface on the sidelines",
        "mainText": "About five years ago, Microsoft scored a $400 million deal to supply the NFL with Surface tablets. With the deal about to expire, the football league just renewed its partnership for the sideline tech with. Competitors",
        "redirectionUrl": "https://www.engadget.com/2017/12/04/microsoft-extends-nfl-deal-surface-sidelines/?sr_source=Twitter"
    },
    {
        "uid": "eebe97a0-d8f0-4d86-b866-c3dff061dcd3",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Where Facebook Has No Friends, Tech Bends to China's Will",
        "mainText": "As he took the stage at China’s premiere internet gathering this week, Facebook Inc.’s Vaughan Smith opened with a line that wouldn’t make sense anywhere else. ``Since not everyone at this event is familiar with Facebook,.",
        "redirectionUrl": "https://www.bloomberg.com/news/articles/2017-12-05/where-facebook-has-no-friends-tech-bends-to-china-s-will"
    },
    {
        "uid": "bc1268cd-b713-4736-8967-653cf03712fa",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "Gmail now works properly on iPhone X and supports third-party accounts",
        "mainText": "Google has finally released an updated version of its Gmail app that fills the entirety of Apple's iPhone X display. The update to the iOS app also adds support for third-party email services like Apple.",
        "redirectionUrl": "https://www.theverge.com/2017/12/5/16737108/gmail-iphone-x-imap-email-support?utm_campaign=theverge&utm_content=chorus&utm_medium=social&utm_source=twitter"
    },
    {
        "uid": "f84899be-f024-4df6-97ee-e73ccc5a44cb",
        "updateDate": "2017-12-05T03:58:49.0Z",
        "titleText": "iPhone X Love Has Doomed Tim Cook's Apple To A Boring And Predictable Future",
        "mainText": "When was the last time Apple introduced something new to the market? When did the company think different? When was the rule book torn up and put back together to benefit the future of Cupertino? During.",
        "redirectionUrl": "https://www.forbes.com/sites/ewanspence/2017/12/04/apple-iphonex-new-timcook-steveballmer-future-strategy-fail"
    }
]
