[
    {
        "uid": "70db24ad-abca-4db2-86d7-bc207604261b",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "Microsoft CEO Satya Nadella recounts his first time meeting Steve Ballmer in 1992",
        "mainText": "Satya Nadella’s first encounter with Steve Ballmer went down probably just as you’d expect. Nadella spoke at the opening launch event for the Global Innovation Exchange, a new U.S.-China tech institute supported in part by $40.",
        "redirectionUrl": "https://www.geekwire.com/2017/microsoft-ceo-satya-nadella-recounts-first-time-meeting-steve-ballmer-1992/"
    },
    {
        "uid": "87006a6c-7259-4186-9fc9-1cc4ab4159bc",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "U.S.-China tech institute GIX names building after former Microsoft CEO Steve Ballmer",
        "mainText": "As GIX prepares to welcome its first class, the new joint U.S.-China technology innovation institute is adding some key partners while tipping its hat to a Microsoft legend. The Global Innovation Exchange (GIX) held a grand.",
        "redirectionUrl": "https://www.geekwire.com/2017/u-s-china-tech-institute-co-funded-microsoft-names-building-steve-ballmer/"
    },
    {
        "uid": "a73ca074-9fa2-4696-b866-4e7a04a28b5a",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "Microsoft’s AI chief wants to launch a chatbot in every country with more than 100M people",
        "mainText": "Microsoft has launched conversational chatbots in several countries so far, starting three years ago with Xiaoice in China, which quickly became a cultural phenomenon in the country. Since then the Redmond- based company has launched chatbots.",
        "redirectionUrl": "https://www.geekwire.com/2017/microsofts-ai-chief-wants-launch-chatbot-every-country-100m-people/"
    },
    {
        "uid": "bc172f9c-f156-4709-aa58-0ea4bb86fb5a",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "Xbox One’s ‘Intelligent Delivery’ system will free up hard drive space",
        "mainText": "Microsoft has been working on a new feature for Xbox One and Xbox One X that stands to save users a ton of storage space. Called Intelligent Delivery, the system allows for game data to.",
        "redirectionUrl": "https://www.engadget.com/2017/09/14/xbox-one-intelligent-delivery-free-up-hard-drive/?utm_source=dlvr.it&utm_medium=twitter"
    },
    {
        "uid": "301bb200-24e3-4dc0-ad01-f59c39dacc35",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "Microsoft Readies New 'Project Honolulu' GUI Tools for Windows Server",
        "mainText": "Microsoft is getting ready to release a preview of Project Honolulu, a graphical management tool set for the upcoming Windows Server version 1709 release and other editions of the operating system software, the company said.",
        "redirectionUrl": "http://www.eweek.com/enterprise-apps/microsoft-readies-new-project-honolulu-gui-tools-for-windows-server"
    },
    {
        "uid": "c80aa9ca-24d8-426d-80f8-1b8a569a9e9c",
        "updateDate": "2017-09-18T08:50:34.0Z",
        "titleText": "Microsoft Pix camera app now can snap documents, too",
        "mainText": "We're using our phone cameras to photograph a lot more than friends and flowers. It's good for taking pictures of restaurant receipts, shopping lists, maps and other documents whose information we want tucked away in.",
        "redirectionUrl": "https://www.cnet.com/news/microsoft-pix-camera-app-can-snap-documents-whiteboards/"
    }
]
