[
    {
        "uid": "0a7e2a1b-e25f-4e70-83b3-7a78fbb033a0",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft Teams opens conversations to outsiders with new guest access feature",
        "mainText": "Microsoft today announced that it’s rolling out guest access for Teams so companies using the collaboration software can now invite guests from outside their companies to join their conversations. Teams, which requires an Office 365",
        "redirectionUrl": "https://venturebeat.com/2017/09/11/microsoft-teams-opens-conversations-to-outsiders-with-new-guest-access-feature/"
    },
    {
        "uid": "221679cc-14b1-4c69-8a05-456a230d28de",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft Teams adds guest access and support for more developer tools",
        "mainText": "Microsoft today announced that 125,000 organizations in 181 markets now use Teams, its Slack competitor for Office 365 subscribers. That’s up from the 30,000 organizations in 145 markets that had adopted the service by the",
        "redirectionUrl": "https://techcrunch.com/2017/09/11/microsoft-teams-gets-guest-access-and-support-for-more-developer-tools/"
    },
    {
        "uid": "a630013c-dc05-4ecb-a43e-f6a513f0d515",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft lays out its strategy for the chat wars with $5 billion Slack",
        "mainText": "When Microsoft entered the market for work chat apps, it created ripples across the industry: $5 billion startup Slack took out a full-page ad in the New York Times welcoming its new rival Microsoft Teams",
        "redirectionUrl": "http://www.businessinsider.com/microsoft-teams-used-by-125000-organizations-gets-guest-access-2017-9"
    },
    {
        "uid": "ffca3629-2d89-48e1-a40b-40d9b0745589",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft launches My Workspace toolbar app for Office365 users on macOS",
        "mainText": "Microsoft has launched a new toolbar app for macOS called My Workspace that plugs into Office 365, bringing quick access to apps, files, and information to the macOS menu bar. The free product is a Garage",
        "redirectionUrl": "https://www.neowin.net/news/microsoft-launches-my-workspace-toolbar-app-for-office365-users-on-macos"
    },
    {
        "uid": "f4f7f6e1-2cd0-4903-b280-90d8a6d02712",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Windows 10’s Built-In Linux Shell Could Be Abused to Hide Malware, Researchers Say",
        "mainText": "Microsoft surprised the technology world last year when it announced that users will be able to run native Linux applications in Windows 10 without virtualization. While this feature is meant to help developers, researchers believe",
        "redirectionUrl": "https://motherboard.vice.com/en_us/article/xwwexa/windows-10s-built-in-linux-shell-could-be-abused-to-hide-malware-researchers-say"
    },
    {
        "uid": "047cb495-ff08-40fd-ac7a-2ff0afc01863",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft Outlook for Android now supports add-ins like Evernote and Trello",
        "mainText": "Microsoft is rolling out add-in support to Outlook for Android this week, more than six months after first debuting mobile add-ins on iOS. The first set of Outlook for Android add-ins includes Evernote, Microsoft Dynamics",
        "redirectionUrl": "https://www.theverge.com/2017/9/11/16286392/microsoft-outlook-android-add-ins-support?utm_campaign=tomwarren&utm_content=chorus&utm_medium=social&utm_source=twitter"
    },
    {
        "uid": "3543b33e-ddf6-4f23-9cbf-ce35c82faec6",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Windows Store device limit per Microsoft account raised to 2,000",
        "mainText": "Back in 2013, Microsoft announced that you could install Windows 8/8.1 apps on up to 81 devices under the same Microsoft account. However, slightly before the launch of Windows 10, the company significantly decreased this",
        "redirectionUrl": "https://www.neowin.net/news/windows-store-device-limit-per-microsoft-account-raised-to-2000"
    },
    {
        "uid": "e48cf698-84a4-42a9-b0c1-7d5936b9a445",
        "updateDate": "2017-09-11T06:51:48.0Z",
        "titleText": "Microsoft And Google Race To Build The World's Smartest Cloud",
        "mainText": "There’s no shortage of reasons for moving your business to cloud storage, provided that you haven’t already done so. Cloud-based platforms such as Amazon Web Services and Microsoft Azure offer a multitude of advantages to",
        "redirectionUrl": "https://www.forbes.com/sites/haroldstark/2017/09/09/microsoft-and-google-race-to-build-the-worlds-smartest-cloud/"
    }
]
