[
    {
        "uid": "bd20987b-1e7d-45f9-afa9-cfc2c137e02b",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Satya Nadella: The C In CEO Stands For Culture",
        "mainText": "In this excerpt from Hit Refresh: The Quest to Rediscover Microsoft’s Soul and Imagine a Better Future for Everyone , Satya Nadella frankly assesses the culture he inherited when he took over in February 2014,.",
        "redirectionUrl": "https://www.fastcompany.com/40457741/satya-nadella-the-c-in-ceo-stands-for-culture?utm_content=buffer7d7ce&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer"
    },
    {
        "uid": "a0923dd1-11a8-4aa1-98b6-cd742890b30b",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Ford adds Microsoft HoloLens to development toolbox",
        "mainText": "Ford is expanding the development use of the Microsoft HoloLens headset globally in hopes of improving the collaboration among its teams and speeding up product development cycles. Over the past year, Ford has been testing the.",
        "redirectionUrl": "https://www.cnet.com/roadshow/news/ford-adds-microsoft-hololens-to-development-toolbox/?utm_source=dlvr.it&utm_medium=twitter#ftag=CADf328eec"
    },
    {
        "uid": "00a8f195-9223-4827-883d-5c736dbfd2f2",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Microsoft's expected Surface Pro with LTE: Possible specs, pricing leak",
        "mainText": "Microsoft officials said earlier this year that the company would deliver at some point, a Surface Pro device with built-in cellular support. If leaks are right, that Intel Core i5 device may be landing fairly.",
        "redirectionUrl": "http://www.zdnet.com/article/microsofts-expected-surface-pro-with-lte-possible-specs-pricing-leak/"
    },
    {
        "uid": "50c3c0f3-63c8-4b69-b0dd-b9ee65971ef0",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Microsoft reportedly opening its first retail store in London",
        "mainText": "Microsoft is reportedly opening its first UK store in London. RetailWeek reports that the software giant is in talks to secure a building at Oxford Circus, a popular shopping venue in the heart of London..",
        "redirectionUrl": "https://www.theverge.com/2017/9/21/16344618/microsoft-store-london-uk-rumor?utm_campaign=tomwarren&utm_content=chorus&utm_medium=social&utm_source=twitter"
    },
    {
        "uid": "af4e1449-42d8-4aa7-9f01-bbdb8952429e",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "As Microsoft Joins Coalition for Better Ads, Blocking by Browsers Looks Set to Spread",
        "mainText": "Microsoft has joined the Coalition for Better Ads, an industry association trying to improve online marketing before frustration drives more consumers to block digital ads themselves. The move suggests that Microsoft's Edge browser could eventually unilaterally.",
        "redirectionUrl": "http://adage.com/article/digital/microsoft-joins-coalition-ads-blocking-browsers-set-spread/310530/?utm_campaign=SocialFlow&utm_source=Twitter&utm_medium=Social"
    },
    {
        "uid": "3221b7b8-9a76-4aae-bdf0-204398baa5fe",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Microsoft OKs Hyperkin’s remake of the original Xbox Duke controller",
        "mainText": "“The Duke” will return to enact its revenge upon all of us. Microsoft has approved Hyperkin’s updated remake of the original Xbox controller, and it is rolling into the next phase of production before the.",
        "redirectionUrl": "https://venturebeat.com/2017/09/20/microsoft-oks-hyperkins-remake-of-the-original-xbox-duke-controller/"
    },
    {
        "uid": "ba74f512-4467-41cd-b6c4-1bb9d8da1afc",
        "updateDate": "2017-09-21T05:29:01.0Z",
        "titleText": "Microsoft opens mysterious office in small town a ferry ride away from Seattle",
        "mainText": "Microsoft has quietly opened a small office in Silverdale, Wash. a town of close to 20,000 across Puget Sound from Seattle. The Tacoma News Tribune first spotted a sign for the Microsoft office at Creekside Office.",
        "redirectionUrl": "https://www.geekwire.com/2017/microsoft-opens-mysterious-office-small-town-ferry-ride-away-seattle/"
    }
]
