[
    {
        "uid": "b31f36df-3e6a-4248-8db1-57f4ce7373f0",
        "updateDate": "2017-11-22T04:06:40.0Z",
        "titleText": "Microsoft just took a big swing at AWS and VMware with new cloud offerings",
        "mainText": "Microsoft is gunning for VMware and AWS with the announcement of two new services today that are designed to let enterprises bring more workloads to Azure. The company announced a beta service for its customers today.",
        "redirectionUrl": "https://venturebeat.com/2017/11/21/microsoft-just-took-a-big-swing-at-aws-and-vmware-with-new-cloud-offerings/"
    },
    {
        "uid": "4ce0115d-10aa-41b2-8fce-ce88151d32b0",
        "updateDate": "2017-11-22T04:06:40.0Z",
        "titleText": "Windows 10 on Arm: Now Asus Snapdragon machine shows up on benchmark tests",
        "mainText": "Microsoft and Qualcomm are planning on launching a number of Windows 10 PCs running on Snapdragon 835 chips by the end of the year. And there's now more evidence Microsoft and its Windows 10 Arm-chip hardware.",
        "redirectionUrl": "http://www.zdnet.com/article/windows-10-on-arm-now-asus-snapdragon-machine-shows-up-on-benchmark-tests/"
    },
    {
        "uid": "feba6d52-b07e-4e5c-a315-8e73fe0a6d2c",
        "updateDate": "2017-11-22T04:06:40.0Z",
        "titleText": "Stop Using Excel, Finance Chiefs Tell Staffs",
        "mainText": "Adobe Inc.’s . finance chief Mark Garrett says his team struggles keeping track of which jobs have been filled at the software company. The process can take days and requires finance staff to pull data from.",
        "redirectionUrl": "https://www.wsj.com/articles/stop-using-excel-finance-chiefs-tell-staffs-1511346601"
    },
    {
        "uid": "77676f8e-4adc-4465-af06-4ded99520c3e",
        "updateDate": "2017-11-22T04:06:40.0Z",
        "titleText": "Skype Removed From Some App Stores in China",
        "mainText": "Skype, the internet-calling and messaging service, has been unavailable for download from some app stores and websites in China, the latest disruption to online communication tools as the government tightens its grip on the internet. The.",
        "redirectionUrl": "https://www.wsj.com/articles/skype-removed-from-some-app-stores-in-china-1511275717?mod=e2tw"
    }
]
