[
    {
        "uid": "98331a58-38b6-4045-bd9c-db1755a1b76a",
        "updateDate": "2017-09-29T02:58:19.0Z",
        "titleText": "Microsoft's Satya Nadella shares the leadership lesson in watching Amazon win the cloud business",
        "mainText": "At a public talk in New York yesterday (Sept. 27) to promote his new book, Microsoft chief Satya Nadella revealed what he learned about leadership in 2009, after watching the tech giant fall woefully behind.",
        "redirectionUrl": "https://qz.com/1089902/microsoft-ceo-satya-nadella-on-the-leadership-lesson-in-watching-amazon-win-the-cloud-business/"
    },
    {
        "uid": "fe559ddf-45d3-4577-8056-31ef8a9efffc",
        "updateDate": "2017-09-29T02:58:19.0Z",
        "titleText": "Acknowledging Fears, Microsoft’s Nadella Remains Optimistic About AI",
        "mainText": "Microsoft Corp. is optimistic about emerging technologies under the leadership of chief executive Satya Nadella, who says artificial intelligence could be an influential catalyst for human empowerment and inclusion. Mr. Nadella, speaking.",
        "redirectionUrl": "https://blogs.wsj.com/cio/2017/09/28/acknowledging-fears-microsofts-nadella-remains-optimistic-about-ai/?mod=WSJBlog"
    },
    {
        "uid": "95b82bef-972a-4922-bbe0-d485518c4c0e",
        "updateDate": "2017-09-29T02:58:19.0Z",
        "titleText": "Is Windows' footprint shrinking? It was 1.5bn users but now Nadella says it's 1bn",
        "mainText": "Microsoft CEO Satya Nadella says there are now one billion Windows users across the world. Nadella gave the new figure in an interview with Bloomberg for the launch of his new book Hit Refresh. Asked about the.",
        "redirectionUrl": "http://www.zdnet.com/article/is-windows-footprint-shrinking-it-was-1-5bn-users-but-now-nadella-says-its-1bn/"
    },
    {
        "uid": "dea8eb4a-3670-453e-bcf4-d6ac0232e353",
        "updateDate": "2017-09-29T02:58:19.0Z",
        "titleText": "Microsoft Ignite 2017: It's all about choice, from SQL Server 2017 to Azure Machine Learning",
        "mainText": "Microsoft is getting really serious about giving customers choices. That much was clear at this week's combined Microsoft Ignite and Envision events in Orlando and, in particular, in announcements around databases, data-integration, machine learning (ML),.",
        "redirectionUrl": "http://www.zdnet.com/article/microsoft-ignite-2017-ms-stresses-choice-from-sql-server-2017-to-azure-machine-learning/"
    }
]
