[
    {
        "uid": "abcd3e2-0950-4a2c-9f5f-77400ce4bd0d",
        "updateDate": "2017-08-25T10:43:41:04.0Z",
        "titleText": "Microsoft Says Xbox One X Is Its Fastest-Selling Console Pre-Order Ever",
        "mainText": "Xbox One X is sold-out at most retailers, burning through Microsoft’s early allotment which seems to indicate a solid level of interest in the new mega-console, despite what naysayers like myself may say.",
        "redirectionUrl": "https://www.forbes.com/sites/insertcoin/2017/08/25/microsoft-says-xbox-one-x-is-its-fastest-selling-console-pre-order-ever/#54af70ad4061"
    },
    {
        "uid": "bb870abc71d-34ca-41a1-a0e5-077db29ce328",
        "updateDate": "2017-08-25T10:43:41:04.0Z",
        "titleText": "Microsoft is easing its Xbox Live ban system",
        "mainText": "Microsoft is planning to overhaul its Xbox Live reputation system. At present the software giant issues each Xbox player with a reputation score that lets other gamers know whether opponents are well behaved or not.",
        "redirectionUrl": "https://www.theverge.com/2017/8/24/16200136/microsoft-xbox-live-reputation-system-changes"
    },
    {
        "uid": "Abc7da88-4edd-468e-8114-fe371dc9a175",
        "updateDate": "2017-08-25T07:56:41:04.0Z",
        "titleText": "Microsoft shows off 'Brainwave' 'real-time AI' platform on FPGAs",
        "mainText": "On August 22, Microsoft unveiled (again) its Project Brainwave deep-learning acceleration platform for real-time artificial intelligence (AI). (I say again, because Microsoft has talked about Brainwave before -- at least a couple times in 2016. This…",
        "redirectionUrl": "http://www.zdnet.com/article/microsoft-shows-off-brainwave-real-time-ai-platform-on-fpgas/"
    },
    {
        "uid": "testing-3bd1-4f0d-a363-8d20cb2a16ae",
        "updateDate": "2017-08-25T07:56:41:04.0Z",
        "titleText": "Microsoft, Oracle Jump Into Blockchain On Same Day -- And Microsoft Is Clear Leader",
        "mainText": "Enterprise-tech heavyweights Oracle and Microsoft each jumped into the red-hot market for blockchain digital technology on the very same day, and one of them looks fully prepared (that would be Microsoft) while the other looks…",
        "redirectionUrl": "https://www.forbes.com/sites/bobevans1/2017/08/22/microsoft-oracle-jump-into-blockchain-on-same-day-and-microsoft-is-clear-leader/#252f124f4b04"
    },
    {
        "uid": "48a4e146-f0b0-40b7-8221-d07d0205b91d",
        "updateDate": "2017-08-25T07:56:41:04.0Z",
        "titleText": "Microsoft to cease work on its GigJam collaboration service",
        "mainText": "Microsoft is throwing in the towel on its GigJam collaboration service, after its public debut two years ago. Microsoft will end the GigJam preview program on September 22, 2017, officials announced today, August 22. GigJam was a…",
        "redirectionUrl": "http://www.zdnet.com/article/microsoft-to-cease-work-on-its-gigjam-collaboration-service/"
    },
    {
        "uid": "81383247-8eff-4e76-8bda-b2c7d3f0077e",
        "updateDate": "2017-08-25T07:56:41:04.0Z",
        "titleText": "Microsoft turns its physical stores into esports gaming arenas with new League of Legends events",
        "mainText": "There may be some heated League of Legends competitions going on the next time you pass by a Microsoft Store. The tech giant announced today that it is partnering with ASUS Republic of Gamers and HyperX…",
        "redirectionUrl": "https://www.geekwire.com/2017/microsoft-turns-physical-stores-esports-gaming-arenas-new-league-legends-events/"
    }
]
