[
    {
        "uid": "e4a00383-03f5-4d47-b2a5-23760371eb1e",
        "updateDate": "2017-10-19T03:02:59.0Z",
        "titleText": "Satya Nadella, the full GeekWire Summit interview: Microsoft’s transformation and the future of tech",
        "mainText": "Satya Nadella is most well known for transforming Microsoft as its third, and current, CEO. He’s taken the company in a new and exciting direction, doubling its stock price and heading new initiatives into bleeding-edge.",
        "redirectionUrl": "https://www.geekwire.com/2017/qa-micosoft-ceo-satya-nadella-on-his-love-of-cricket-his-leadership-style-and-the-future-of-technology/"
    },
    {
        "uid": "1c9abc18-de61-465d-b0e6-539956f4e54e",
        "updateDate": "2017-10-19T03:02:59.0Z",
        "titleText": "Nintendo Switch outsells Sony and Microsoft heading into the holiday season",
        "mainText": "Nintendo’s Switch has claimed another month. The home console/portable hybrid was the top-selling system in September in the U.S., according to the industry-tracking firm The NPD Group. But it wasn’t the only successful Nintendo product of.",
        "redirectionUrl": "https://venturebeat.com/2017/10/19/nintendo-switch-outsells-sony-and-microsoft-heading-into-the-holiday-season/"
    },
    {
        "uid": "0ae7de98-2cec-44aa-b22f-1167b7b73a08",
        "updateDate": "2017-10-19T03:02:59.0Z",
        "titleText": "Does Windows 10's Security Boost Make Antivirus Obsolete?",
        "mainText": "With the Windows 10 Creators Update this spring, the venerable Windows Defender got a new name— Microsoft Windows Defender Security Center —and a leap in functionality. In addition to antivirus, it manages Windows Firewall, SmartScreen.",
        "redirectionUrl": "https://www.pcmag.com/article/356835/does-windows-10s-security-boost-make-antivirus-obsolete"
    },
    {
        "uid": "a9fe0adc-4214-4456-bbdc-c745323f0cf2",
        "updateDate": "2017-10-19T03:02:59.0Z",
        "titleText": "Developers rejoice: Microsoft, Google, Mozilla are putting all their web API docs in one place",
        "mainText": "Three big browser makers have agreed to put their cross-browser documentation on the Mozilla Developer Network (MDN) wiki. Mozilla's MDN Web Docs will now be home to documentation about web APIs and information on Chrome, Edge,.",
        "redirectionUrl": "http://www.zdnet.com/article/developers-rejoice-microsoft-google-mozilla-are-putting-all-their-web-api-docs-in-one-place/"
    },
    {
        "uid": "1d802dba-8441-4579-81f0-b294067b10f8",
        "updateDate": "2017-10-19T03:02:59.0Z",
        "titleText": "Adobe Photoshop adds support for Microsoft's Surface Dial",
        "mainText": "As part of its Creative Cloud 2018 rollout, Adobe has revealed that Microsoft's Surface Dial, seemingly made for Photoshop CC, is finally supported by the app. Adobe notes that for now, it's shipping as a.",
        "redirectionUrl": "https://www.engadget.com/2017/10/18/adobe-photoshop-surface-dial/?utm_source=dlvr.it&utm_medium=twitter"
    }
]
