[
    {
        "uid": "1b0477a7-a16d-47f7-b0d2-088e15152f6b",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "Microsoft will drop suit after DoJ agrees to limit use of gag orders",
        "mainText": "Microsoft said Monday it will drop a lawsuit against the federal government after the Justice Department agreed to limit is use of 'gag orders' to prevent Internet service providers from notifying customers that the government.",
        "redirectionUrl": "https://www.axios.com/microsoft-will-drop-suit-after-doj-agrees-to-limit-use-of-gag-orders-2500570926.html?utm_source=twitter&utm_medium=twsocialshare&utm_campaign=organic"
    },
    {
        "uid": "90c0d104-bf7d-43d0-a46f-967d4e94ea77",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "Microsoft's Windows 10 Fall Creators Update rollout: A progress report",
        "mainText": "It's been just about a week since Microsoft started rolling out the Windows 10 Fall Creators Update to mainstream users on various devices. What's the early feedback look like? I've heard from a number of PC.",
        "redirectionUrl": "http://www.zdnet.com/article/microsofts-windows-10-fall-creators-update-rollout-a-progress-report/"
    },
    {
        "uid": "15fbf2be-2891-4621-bb12-92e8ea72a266",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "Backwards Compatibility On Xbox One Is One Of Microsoft's Best Ideas, And It Keeps Getting Better",
        "mainText": "You'd have a hard time believing them if someone told you about it back in 2013. But here we are, four years into the lifespan of the Xbox One, and Microsoft's console just got a.",
        "redirectionUrl": "https://www.forbes.com/sites/davidthier/2017/10/24/backwards-compatibility-on-xbox-one-is-one-of-microsofts-best-ideas-and-it-keeps-getting-better/"
    },
    {
        "uid": "7efb2954-2306-4526-b37b-0a832ec37156",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "How Microsoft Edge will beat Chrome as the best PDF reader with the Fall Creators Update",
        "mainText": "Microsoft Edge is gaining new PDF reader features within the Windows 10 Fall Creator’s Update— everything from sticky notes to inked signatures. It’s part of Microsoft’s bid to compete with Chrome and Firefox as the best.",
        "redirectionUrl": "https://www.pcworld.com/article/3219693/browsers/how-microsoft-edge-will-beat-chrome-as-the-best-pdf-reader-with-the-fall-creators-update.html"
    },
    {
        "uid": "97d53266-8ceb-472d-9810-f013600a30ea",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "Microsoft-owned Mixer debuts new interactive streaming tools for Minecraft",
        "mainText": "Minecraft is getting even more interactive thanks to a new tool from Mixer. The Microsoft-owned streaming platform today announced new features that let people watching Minecraft streams interact with the gameplay in real-time. Minecraft streamers can add.",
        "redirectionUrl": "https://www.geekwire.com/2017/microsoft-owned-mixer-debuts-new-interactive-streaming-tools-minecraft/"
    },
    {
        "uid": "eefcab1d-4cf1-483d-9f51-da49263d23ba",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "Microsoft’s Learning Tools for students heads to Word on iPad",
        "mainText": "With its Learning Tools, Microsoft has developed a few ways to make it easier for students to get a better handle on reading and writing. One tool, for example, can read your words aloud and.",
        "redirectionUrl": "https://www.engadget.com/2017/10/23/microsoft-learning-tools-word-ipad/?sr_source=Twitter"
    },
    {
        "uid": "dcda7b27-7906-4b58-93ba-5f352ea2764a",
        "updateDate": "2017-10-24T03:00:38.0Z",
        "titleText": "What A Microsoft CMO Did (And Didn’t) Learn At Procter & Gamble",
        "mainText": "Grad Conn has been the general manager and CMO of Microsoft’s U.S. sales organization since 2011. Early in his career, he spent time as a brand manager at Procter & Gamble—a legendary boot camp in.",
        "redirectionUrl": "https://www.fastcompany.com/40483384/what-a-microsoft-cmo-did-and-didnt-learn-at-procter-gamble"
    }
]
